--[[
--@haiderqwwq97_bot
--@haiderqwwq
—]]
do

function run(msg, matches)
  return [[ 
اهــ❤️ــلآ بـ💋ـك فـ😘ـي الـ😉ـسـ🙈ـورس

🔵 الاصدار v2
🔴سورس يخلي من الاخطاء
⚫️مدة توقف سورس لاتقل عن 7ساعات

مطور السورس (🇧 🇷 🇼 🇺 🇪 🇳) > @haiderqwwq

لمراسله صانع السورس ↶↶↶
▫️ @haiderqwwq
▪️ @haiderqwwq97_bot

مدونتنا ( https://brwuen.blogspot.com )

🚧 تابع قناتنا للبوتات ⬇️ 🚧

@haiderqwwq 🗼 @roroc1

🚧 تابع قناه لتطوير بوتك ⬆️ 🚧
]]
end

return {
  description = "", 
  usage = "!السورس:",
  patterns = {
    "^السورس$"
  }, 
  run = run 
}

end
